examples/EmberPaperCases/Basic/ab_YesFenceNoHouse/a_windSim/0/Cd.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Cd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    xMin
    {
        type            fixedValue;
        value           uniform 0;
    }
    xMax
    {
        type            fixedValue;
        value           uniform 0;
    }
    yMin
    {
        type            fixedValue;
        value           uniform 0;
    }
    yMax
    {
        type            fixedValue;
        value           uniform 0;
    }
    zMax
    {
        type            fixedValue;
        value           uniform 0;
    }
    ground
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
